package ua.kpi.dziuba.gasstation.service;

import org.springframework.stereotype.Component;
import ua.kpi.dziuba.gasstation.model.IRefill;
import ua.kpi.dziuba.gasstation.model.impl.Refill;

import java.util.List;
import java.util.UUID;

/**
 * Клас - сервіс, який викликається із відповідного контроллера та
 * використовує відповідний репозиторій для своєї роботи.
 */
@Component
public interface IRefillService {

    /**
     * Метод, який викликається з контроллера для обробки запиту клієнта на
     * видачу списку попередніх заправок користувача. Вилучає всі попередні заправки
     * користувача із бази даних по параметру унікального ідентифікатора користувача
     *
     * @param userGuid - унікальний ідентифікатор користувача, по якому будуть
     *                вилучатися дані із бази
     * @return список вилучених колонок із пальним із бази даних по заданим
     * параметрам.
     */
    List<IRefill> getAllRefills(UUID userGuid);

    /**
     * Метод, який викликається з контроллера для обробки запиту клієнта на
     * видачу списку попередніх заправок користувача. Вилучає всі попередні заправки
     * користувача із бази даних по параметру попередньої заправки
     *
     * @param refill - попередня заправка, по якій будуть вилучатися дані із бази
     * @return список вилучених колонок із пальним із бази даних по заданим
     * параметрам.
     */
    IRefill createNewRefill(Refill refill);
}
