package ua.kpi.dziuba.gasstation.service;

import org.springframework.stereotype.Component;
import ua.kpi.dziuba.gasstation.model.ITemplate;

import java.util.List;
import java.util.UUID;

/**
 * Клас - сервіс, який викликається із відповідного контроллера та
 * використовує відповідний репозиторій для своєї роботи.
 */
@Component
public interface ITemplateService {

    /**
     * Метод, який викликається з контроллера для обробки запиту клієнта на  видачу
     * списку попередніх заправок користувача. Вилучає всі шаблони заповнення даних
     * заправки користувача із бази даних по параметру унікального ідентифікатора
     * користувача
     *
     * @param userGuid - унікальний ідентифікатор користувача, по якому будуть
     *                вилучатися дані із бази
     * @return список вилучених шаблонів із бази даних по заданим параметрам.
     */
    List<ITemplate> getAllTemplatesByUserGuid(UUID userGuid);

    /**
     * Метод, який викликається з контроллера для обробки запиту клієнта на створення
     * нового шаблону введення даних заправки користувача.
     *
     * @param newTemplate - тіло нового шаблону із даними
     * @return новий шаблон із бази даних по заданим параметрам.
     */
    ITemplate createTemplate(ITemplate newTemplate);

    /**
     * Метод, який викликається з контроллера для обробки запиту клієнта на оновлення
     * попередньо створеного шаблону користувача. Оновлює сутність в базі даних по
     * параметру унікального ідентифікатора шаблону
     *
     * @param newTemplateInfo - тіло шаблону із новими даними
     * @return оновлений шаблон із бази даних по заданим параметрам.
     */
    ITemplate updateTemplate(ITemplate newTemplateInfo);

    /**
     * Метод, який викликається з контроллера для обробки запиту клієнта для видалення
     * шаблону введення даних заправки користувача.
     *
     * @param userGuid - унікальний ідентифікатор користувача, по якому буде
     *                видалятися шаблон
     * @param id - унікальний ідентифікатор шаблону, по якому буде видалятися шаблон із бази
     */
    void removeTemplateById(Integer id, UUID userGuid);

    /**
     * Метод, який викликається з контроллера для обробки запиту клієнта на
     * видачу списку колонок із пальним. Вилучає все пальне із бази даних по
     * параметрах унікального ідентифікатора користувача та назви шаблону
     *
     * @param userGuid - унікальний ідентифікатор користувача, по якому будуть
     *                вилучатися дані із бази
     * @param templateName - назва шаблону, по якій будуть вилучатися дані з бази
     * @return список вилучених шаблонів із бази даних по заданим параметрам.
     */
    List<ITemplate> getAllTemplatesByName(UUID userGuid, String templateName);
}
