insert into templates(user_guid, id_fuel, name) VALUES
('eb5d27b7-1d4c-404d-98ed-6ac3c5ee0920', 8, 'Найпопулярніший'),
('2444c5e9-adfe-47cb-bf5f-ad8391b41489', 8, 'Найпопулярніший'),
('ed19d725-f912-48df-a461-baad02f0b1c4', 8, 'Найпопулярніший'),
('67563a89-61b3-4f3e-bee1-f4e6e5d79180', 8, 'Найпопулярніший'),
('0d78c19c-309b-456b-a88a-2b1648d62d82', 8, 'Найпопулярніший'),
('fa20283b-2570-41b6-934d-2425f5a047fd', 8, 'Найпопулярніший'),
('0390dcde-1997-421d-a716-5bb50e4ba8cd', 8, 'Найпопулярніший'),
('53dc8a9e-5ef5-4eae-b233-d9791306a8cb', 8, 'Найпопулярніший'),
('3f2aed34-85c4-4a06-86de-8dc6812e21cc', 8, 'Найпопулярніший');